export const Q = [
  {
    type: "EI",
    title: "모르는 사람들과 팀이 됐다. 나의 반응은?",
    a1: "아이스 브레이킹으로 뭘 하지?",
    a2: "어떻게 어울릴지 걱정이다.",
  },
  {
    type: "EI",
    title:
      "해커톤이 끝난 뒤 조장이 회식하자고 한다.난 피곤한 상태이다, 나의 반응은?",
    a1: "피곤하지만 다들 고생한걸 축하하는 기념으로 참석한다",
    a2: "어떻게 어울릴지 걱정이다.",
  },
  {
    type: "EI",
    title:
      "해커톤이 끝난 뒤 며칠 후 조장에게 다른 대회를 같이 참석하자는 권유가 왔다. 나의 반응은?",
    a1: "좋은 기회가 또 찾아와서 좋다. 새로운 사람들과 또 개발할 생각에 설렌다",
    a2: "어떻게 어울릴지 걱정이다.",
  },
  {
    type: "PJ",
    title: "대회의 타임테이블이 나왔다. 나의 반응은?1",
    a1: "나랑 상관 없는 일이다.",
    a2: "pt 준비는 내일 오전 8시 45분부터 하면 되겠군",
  },
  {
    type: "PJ",
    title: "웹사이트를 만들어야한다. 내가 먼저 할 일은?",
    a1: "일단 코드부터 짜고 본다",
    a2: "페이지 구성도를 먼저 만든다",
  },
  {
    type: "PJ",
    title: "발표 때 예상치 못한 오류가 발생했다. 나의 반응은?",
    a1: "최종 파일 전에 저장한 데모파일이라도 연결해 발표를 어떻게든 마친다.",
    a2: "머리가 하얘진다",
  },
  {
    type: "NS",
    title: "브레인 스토밍 시간이다. 나의 반응은?1",
    a1: "실현 불가능한 아이디어만 냄",
    a2: "고민 하느라 한 마디도 못함.",
  },
  {
    type: "NS",
    title: "팀원간의 코드가 달라 합쳐야 되는 상황이다. 나의 반응은?",
    a1: "자신의 지식을 바탕으로 합친다",
    a2: "구글링한다",
  },
  {
    type: "NS",
    title: "해커톤이 끝난뒤, 대회 관계자가 명함을 받아가라고 했다. 나의 반응은",
    a1: "혹시 나 스카우트??",
    a2: "아무나 다 주나보다",
  },
  {
    type: "TF",
    title: "팀원이 매우 지쳐있다. 나의 반응은?",
    a1: "다 같이 힘든데..",
    a2: "주머니에 몰래 챙겨온 마이쭈를 준다.",
  },
  {
    type: "TF",
    title: "코드에서 알수 없는 오류가 계속 뜬다. 나의 반응은?",
    a1: "침착하게 오류의 원인을 분석한다",
    a2: "답답한 마음을 먼저 표출하고 오류를 찾아 나선다",
  },
  {
    type: "TF",
    title:
      "나의 이상형이 같은 팀이 되었는데, 이상형이 자꾸 나에게 말을 건다. 나의 반응은?",
    a1: "정신차리고 내 핳 일을 하고 상대에게도 집중하라고 주의를 준다.",
    a2: "가슴이 쿵쾅거려 집중을 하지 못한다",
  },
  {
    type: "EI",
    title: "해커톤 끝나고 뒷풀이가 있다고 한다. 나의 반응은?",
    a1: "얘기 듣는 순간부터 설렘",
    a2: "집에 가고 싶다.",
  },

  {
    type: "NS",
    title: "해커톤 전날 밤, 자려고 누웠다. 내 머릿속은?",
    a1: "내일 시상식 때 수상소감으로 무슨 말을 할지 머릿속에 대본을 짠다.",
    a2: "별 생각 없이 쿨쿨 잠만 잔다.",
  },

  {
    type: "TF",
    title: "팀원이 작성한 코드가 다 날라갔다고 한다. 나의 반응은?",
    a1: "그니까 저장을 수시로 했어야지..",
    a2: "낙담하고 있는 그 팀원을 위로한다.",
  },

  {
    type: "PJ",
    title: "우리의 프로젝트가 계획에서 벗어나버렸다. 나의 반응은?",
    a1: "계획은 언제나 바뀔 수 있는 거다.",
    a2: "계획에서 벗어난 것에 스트레스를 받는다.",
  },
  {
    type: "TF",
    title: `Q11. 열심히 안 하시는 것 같던데 진짜 잘하셨네요!
          라는 팀원의 말을 들었을 때 나의 반응은?`,
    a1: "흐흐 칭찬 감사",
    a2: "나 엄청 열심히 했는데..",
  },
  {
    type: "TF",
    title: "Q12. 한 팀원만 자신의 의견을 고집부린다. 이때 나의 반응은?",
    a1: "논리적으로 설득한다.",
    a2: "기분 상하지 않게 설득한다.",
  },
  {
    type: "PJ",
    title:
      "Q6. 갑작스럽게 한 부분을 수정해야 하는 상황이 생겼다. 이때 나의 반응은? ",
    a1: "당황하며 급하게 다시 만든다..",
    a2: "미리 생각해 놨던 대비책으로 실행한다.",
  },
  {
    type: "NS",
    title:
      "Q7. 해커톤 장소에 도착했는데 생각보다 많이 허름하다. 이때 나의 반응은? ",
    a1: "해커톤 도중 무너질까봐 무섭다. ",
    a2: "아무 생각 없다.",
  },
  {
    type: "EI",
    title: "Q2. 결과물 발표를 맡게 됐다. 이때 나의 반응은?",
    a1: "사람들에게 나의 발표를\n 들려줄 수 있어서 내심 설렌다.",
    a2: "머릿속으로 미리 삼천 번 정도 연습해 본다..",
  },
];
